public class Treasure {
    static int numbers=6;
    static char Ｗ = '▓';
    static char Ｐ = '＊';
    static char Ｅ = '　';
    static char Ｖ = '＃';
    static char Ｔ = '❉';
    static char[][] map = {
            {Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ},
            {Ｗ,Ｐ,Ｗ,Ｅ,Ｗ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｗ,Ｗ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｗ},
            {Ｗ,Ｅ,Ｗ,Ｅ,Ｗ,Ｗ,Ｗ,Ｅ,Ｗ,Ｗ,Ｗ,Ｅ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｅ,Ｗ,Ｗ,Ｗ,Ｅ,Ｗ},
            {Ｗ,Ｅ,Ｅ,Ｅ,Ｗ,Ｅ,Ｅ,Ｅ,Ｗ,Ｗ,Ｗ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｗ,Ｗ,Ｗ,Ｅ,Ｗ},
            {Ｗ,Ｅ,Ｗ,Ｅ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｅ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｅ,Ｗ,Ｗ,Ｗ,Ｅ,Ｗ},
            {Ｗ,Ｅ,Ｗ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｗ,Ｅ,Ｗ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｗ},
            {Ｗ,Ｅ,Ｗ,Ｅ,Ｗ,Ｅ,Ｗ,Ｗ,Ｗ,Ｗ,Ｅ,Ｅ,Ｅ,Ｅ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｅ,Ｅ,Ｗ},
            {Ｗ,Ｅ,Ｗ,Ｅ,Ｗ,Ｗ,Ｗ,Ｅ,Ｅ,Ｗ,Ｅ,Ｗ,Ｗ,Ｅ,Ｗ,Ｗ,Ｗ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｗ},
            {Ｗ,Ｗ,Ｗ,Ｅ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｅ,Ｅ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｅ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ},
            {Ｗ,Ｅ,Ｅ,Ｅ,Ｗ,Ｗ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｗ,Ｗ,Ｅ,Ｅ,Ｅ,Ｗ,Ｗ,Ｅ,Ｗ,Ｗ},
            {Ｗ,Ｅ,Ｗ,Ｅ,Ｗ,Ｗ,Ｅ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｅ,Ｗ,Ｗ,Ｅ,Ｗ,Ｅ,Ｅ,Ｗ,Ｅ,Ｗ,Ｗ},
            {Ｗ,Ｅ,Ｗ,Ｗ,Ｗ,Ｗ,Ｅ,Ｗ,Ｗ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｅ,Ｗ,Ｗ,Ｅ,Ｅ,Ｗ,Ｗ,Ｗ},
            {Ｗ,Ｅ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｅ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｅ,Ｗ,Ｗ,Ｗ,Ｗ},
            {Ｗ,Ｅ,Ｅ,Ｅ,Ｗ,Ｅ,Ｗ,Ｗ,Ｅ,Ｅ,Ｗ,Ｗ,Ｅ,Ｅ,Ｗ,Ｗ,Ｗ,Ｗ,Ｅ,Ｅ,Ｅ,Ｗ,Ｗ},
            {Ｗ,Ｗ,Ｗ,Ｅ,Ｗ,Ｅ,Ｅ,Ｅ,Ｅ,Ｗ,Ｗ,Ｗ,Ｗ,Ｅ,Ｗ,Ｗ,Ｗ,Ｗ,Ｅ,Ｗ,Ｅ,Ｅ,Ｗ},
            {Ｗ,Ｗ,Ｗ,Ｅ,Ｅ,Ｅ,Ｅ,Ｗ,Ｅ,Ｅ,Ｗ,Ｅ,Ｅ,Ｅ,Ｗ,Ｗ,Ｅ,Ｅ,Ｅ,Ｗ,Ｗ,Ｅ,Ｗ},
            {Ｗ,Ｗ,Ｗ,Ｗ,Ｅ,Ｅ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｅ,Ｅ,Ｅ,Ｅ,Ｗ,Ｗ,Ｗ,Ｗ,Ｖ,Ｗ},
            {Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ,Ｗ}
    };

    public Treasure(int num) {
        map[1][3]=Ｔ;
        map[3][5]=Ｔ;
        map[13][1]=Ｔ;
        map[11][11]=Ｔ;
        map[5][16]=Ｔ;
        map[16][13]=Ｔ;
    }
    public static int getNumbers(char[][] mapNow){
        int numbersNow=0;
        for (int x=0;x<mapNow.length;x++) {
            for (int y=0;y<mapNow[0].length;y++) {
                if (mapNow[x][y]==Ｔ) {
                    numbersNow++;
                }
            }

        }
        return numbersNow;
    }
    public static char[][] getMap()
    {
        return map;
    }
}
